#define _POSIX_C_SOURCE 200809L
#include <stdio.h>
#include <string.h>
#include <locale.h>

void main() {
    
    // การประกาศและกำหนดค่าตัวแปร
    // ตัวแปรชนิด char สามารถเก็บข้อมูลได้เพียงตัวเดียว และใช้เครื่องหมาย ' ในการกำหนดค่า
    char a = 'A'; // ประกาศตัวแปรชนิด char ชื่อ a และกำหนดค่าเริ่มต้นเป็น 'A'
    char b = 'B'; // ประกาศตัวแปรชนิด char ชื่อ b และกำหนดค่าเริ่มต้นเป็น 'B'
    char c = 'C'; // ประกาศตัวแปรชนิด char ชื่อ c และกำหนดค่าเริ่มต้นเป็น 'C'
    
    // การแสดงผล
    printf("a = %c\n", a); // แสดงค่าของตัวแปร a โดยใช้ %c แทนตัวแปรชนิด char
    printf("b = %c\n", b); // แสดงค่าของตัวแปร b โดยใช้ %c แทนตัวแปรชนิด char
    printf("c = %c\n", c); // แสดงค่าของตัวแปร c โดยใช้ %c แทนตัวแปรชนิด char

    printf("----------------\n");

    // การเปลี่ยนแปลงค่าตัวแปร
    // การเปลี่ยนแปลงค่าตัวแปรในภาษา C สามารถทำได้โดยการกำหนดค่าใหม่ให้กับตัวแปร
    a = 'X'; // กำหนดค่าใหม่ให้ตัวแปร a เป็น 'X'
    b = 'Y'; // กำหนดค่าใหม่ให้ตัวแปร b เป็น 'Y'
    c = 'Z'; // กำหนดค่าใหม่ให้ตัวแปร c เป็น 'Z'

    // การแสดงผล
    printf("a = %c\n", a); // แสดงค่าของตัวแปร a โดยใช้ %c แทนตัวแปรชนิด char
    printf("b = %c\n", b); // แสดงค่าของตัวแปร b โดยใช้ %c แทนตัวแปรชนิด char
    printf("c = %c\n", c); // แสดงค่าของตัวแปร c โดยใช้ %c แทนตัวแปรชนิด char

    printf("----------------\n");

    // Character Array
    // ตัวแปรชนิด char สามารถเก็บข้อมูลได้มากกว่าหนึ่งตัว โดยใช้เครื่องหมาย " ในการกำหนดค่า
    char s[] = "Hello, world!"; // ประกาศตัวแปรชนิด char ชื่อ s และกำหนดค่าเริ่มต้นเป็น "Hello, world!"
    char name[30] = "John Doe"; // ประกาศตัวแปรชนิด char ชื่อ name และกำหนดค่าเริ่มต้นเป็น "John Doe"
    char address[50] = "1234 Main St, Springfield, IL 62701"; // ประกาศตัวแปรชนิด char ชื่อ address และกำหนดค่าเริ่มต้นเป็น "1234 Main St, Springfield, IL 62701"
    char phone[15] = "123-456-7890"; // ประกาศตัวแปรชนิด char ชื่อ phone และกำหนดค่าเริ่มต้นเป็น "123-456-7890"
    char email[30] = "samit@email.com"; // ประกาศตัวแปรชนิด char ชื่อ email และกำหนดค่าเริ่มต้นเป็น "


    // การแสดงผล
    printf("s = %s\n", s); // แสดงค่าของตัวแปร s โดยใช้ %s แทนตัวแปรชนิด char
    printf("name = %s\n", name); // แสดงค่าของตัวแปร name โดยใช้ %s แทนตัวแปรชนิด char
    printf("address = %s\n", address); // แสดงค่าของตัวแปร address โดยใช้ %s แทนตัวแปรชนิด char
    printf("phone = %s\n", phone); // แสดงค่าของตัวแปร phone โดยใช้ %s แทนตัวแปรชนิด char
    printf("email = %s\n", email); // แสดงค่าของตัวแปร email โดยใช้ %s แทนตัวแปรชนิด char

    // การใช้ฟังก์ชัน strlen( )
    // ฟังก์ชัน strlen( ) ใช้สำหรับคํานวณความยาวของอาร์เรย์ที่เก็บข้อมูลเป็นอาร์เรย์ชนิด char
    printf("strlen(\"%s\") = %ld\n", s, strlen(s)); // แสดงค่าของฟังก์ชัน strlen( ) โดยใช้ %ld แทนตัวแปรชนิด long
    printf("strlen(\"%s\") = %ld\n", name, strlen(name)); // แสดงค่าของฟังก์ชัน strlen( ) โดยใช้ %ld แทนตัวแปรชนิด long 


    printf("----------------\n");

    // การใช้ฟังก์ชัน strcpy( )
    // ฟังก์ชัน strcpy( ) ใช้สำหรับกําหนดค่าใหม่ให้กับตัวแปรชนิด char ที่เก็บข้อมูลเป็นอาร์เรย์
    char t[30]; // ประกาศตัวแปรชนิด char ชื่อ t โดยไม่กำหนดค่าเริ่มต้น
    strcpy(t, "Hello, world!"); // กําหนดค่าใหม่ให้กับตัวแปร t โดยใช้ฟังก์ชัน strcpy( )
    printf("t = %s\n", t); // แสดงค่าของตัวแปร t โดยใช้ %s แทนตัวแปรชนิด char

    printf("----------------\n");

    // การใช้ฟังก์ชัน strcat( )
    // ฟังก์ชัน strcat( ) ใช้สำหรับเชื่อมต่อข้อมูลใหม่กับข้อมูลเดิมที่เก็บในตัวแปรชนิด char ที่เก็บข้อมูลเป็นอาร์เรย์
    char u[30] = "Hello, "; // ประกาศตัวแปรชนิด char ชื่อ u และกำหนดค่าเริ่มต้นเป็น "Hello, "
    strcat(u, "world!"); // เชื่อมต่อข้อมูลใหม่กับข้อมูลเดิมที่เก็บในตัวแปร u โดยใช้ฟังก์ชัน strcat( )
    printf("u = %s\n", u); // แสดงค่าของตัวแปร u โดยใช้ %s แทนตัวแปรชนิด char

    printf("----------------\n");

    // อักขระพิเศษ (Escape Sequence)
    // อักขระพิเศษในภาษา C ใช้สำหรับการแสดงผลอักขระพิเศษ เช่น \n, \t, \", \', \\, \0
    printf("Hello, world!\n"); // แสดงค่าของอักขระพิเศษ \n โดยใช้ \n แทนอักขระพิเศษ
    printf("Hello, \tworld!\n"); // แสดงค่าของอักขระพิเศษ \t โดยใช้ \t แทนอักขระพิเศษ
    printf("Hello, \"world!\"\n"); // แสดงค่าของอักขระพิเศษ \" โดยใช้ \" แทนอักขระพิเศษ
    printf("Hello, \'world!\'\n"); // แสดงค่าของอักขระพิเศษ \' โดยใช้ \' แทนอักขระพิเศษ
    printf("Hello, \\world!\n"); // แสดงค่าของอักขระพิเศษ \\ โดยใช้ \\ แทนอักขระพิเศษ
    printf("Hello, \0world!\n\n"); // แสดงค่าของอักขระพิเศษ \0 โดยใช้ \0 แทนอักขระพิเศษ

    printf("\n----------------\n");

    // การจัดรูปแบบในเบื้องต้นสำหรับ printf( )
    // การจัดรูปแบบในเบื้องต้นสำหรับฟังก์ชัน printf( ) สามารถทำได้โดยการใช้เครื่องหมาย % และชื่อของชนิดข้อมูลที่ต้องการแสดงผล
    printf("a = %c\n", a); // แสดงค่าของตัวแปร a โดยใช้ %c แทนตัวแปรชนิด char
    printf("b = %c\n", b); // แสดงค่าของตัวแปร b โดยใช้ %c แทนตัวแปรชนิด char
    printf("c = %c\n", c); // แสดงค่าของตัวแปร c โดยใช้ %c แทนตัวแปรชนิด char
    printf("s = %s\n", s); // แสดงค่าของตัวแปร s โดยใช้ %s แทนตัวแปรชนิด char
    
    printf("----------------\n");

    // การจัดรูปแบบตัวเลขโดยมี , คั่นหลักพัน
    // การจัดรูปแบบตัวเลขโดยมี , คั่นหลักพันสามารถทำได้โดยการใช้ %' และชื่อของชนิดข้อมูลที่ต้องการแสดงผล
    setlocale(LC_ALL, "");
    int x = 1234567890; // ประกาศตัวแปรชนิด int ชื่อ x และกำหนดค่าเริ่มต้นเป็น 1234567890
    double y = 987654321.357; // ประกาศตัวแปรชนิด int ชื่อ y และกำหนดค่าเริ่มต้นเป็น 987654321.357

    printf("x = %'d\n", x); // แสดงค่าของตัวแปร x โดยใช้ %'d แทนตัวแปรชนิด int
    printf("y = %'.2f\n", y); // แสดงค่าของตัวแปร y โดยใช้ %'f แทนตัวแปรชนิด double

    printf("----------------\n");

}