#include <stdio.h>

void main() {
    
    // ชนิดข้อมูลและตัวแปร
    // ชนิดข้อมูลในภาษา C มีหลายชนิด แต่สามชนิดที่ใช้กันมากคือ int, float และ char
    // ตัวแปรคือชื่อที่ใช้เก็บข้อมูล โดยตัวแปรจะต้องประกาศก่อนใช้งาน
    int a; // ประกาศตัวแปรชนิด int ชื่อ a

    // ตัวแปรที่ประกาศแล้วจะต้องใช้คำสั่งในการกำหนดค่าก่อนใช้งาน
    a = 5; // กำหนดค่าให้ตัวแปร a เป็น 5

    // ตัวแปรประกอบด้วยชื่อตัวแปร ชนิดข้อมูล และค่าเริ่มต้น
    int b = 10; // ประกาศตัวแปรชนิด int ชื่อ b และกำหนดค่าเริ่มต้นเป็น 10

    // การแสดงผล
    printf("a = %d\n", a); // แสดงค่าของตัวแปร a โดยใช้ %d แทนตัวแปรชนิด int
    printf("b = %d\n", b); // แสดงค่าของตัวแปร b โดยใช้ %d แทนตัวแปรชนิด int

    printf("----------------\n");

    // Predefined Data Types
    // Integers (int) จำนวนเต็ม เช่น 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
    int c = 5; // ประกาศตัวแปรชนิด int ชื่อ c และกำหนดค่าเริ่มต้นเป็น 5

    // Floating-point Numbers (float) จำนวนจริง เช่น 1.0, 2.0, 3.0, 4.0, 5.0
    float d = 3.14; // ประกาศตัวแปรชนิด float ชื่อ d และกำหนดค่าเริ่มต้นเป็น 3.14

    // Characters (char) ตัวอักษร เช่น 'A', 'B', 'C', 'D', 'E'
    char e = 'A'; // ประกาศตัวแปรชนิด char ชื่อ e และกำหนดค่าเริ่มต้นเป็น 'A'

    // Boolean (_Bool) ค่าความจริง เช่น 0 (เท็จ), 1 (จริง)
    _Bool f = 1; // ประกาศตัวแปรชนิด _Bool ชื่อ f และกำหนดค่าเริ่มต้นเป็น 1

    // การแสดงผล
    printf("c = %d\n", c); // แสดงค่าของตัวแปร c โดยใช้ %d แทนตัวแปรชนิด int
    printf("d = %f\n", d); // แสดงค่าของตัวแปร d โดยใช้ %f แทนตัวแปรชนิด float
    printf("e = %c\n", e); // แสดงค่าของตัวแปร e โดยใช้ %c แทนตัวแปรชนิด char
    printf("f = %d\n", f); // แสดงค่าของตัวแปร f โดยใช้ %d แทนตัวแปรชนิด _Bool

    printf("----------------\n");

    // การแปลงชนิดข้อมูล
    // การแปลงชนิดข้อมูลในภาษา C สามารถทำได้โดยการใช้ชื่อของชนิดข้อมูลเป้าหมายเป็นคำหลักของตัวแปร
    // Implicit Conversion การแปลงชนิดข้อมูลโดยอัตโนมัติ
    int g = 5; // ประกาศตัวแปรชนิด int ชื่อ g และกำหนดค่าเริ่มต้นเป็น 5
    float h = g; // ประกาศตัวแปรชนิด float ชื่อ h และกำหนดค่าเริ่มต้นเป็น g โดยมีการแปลงชนิดข้อมูลอัตโนมัติ

    printf("g = %d\n", g); // แสดงค่าของตัวแปร g โดยใช้ %d แทนตัวแปรชนิด int
    printf("h = %f\n", h); // แสดงค่าของตัวแปร h โดยใช้ %f แทนตัวแปรชนิด float

    // Explicit Conversion การแปลงชนิดข้อมูลโดยการใช้ชื่อของชนิดข้อมูลเป้าหมายเป็นคำหลักของตัวแปร
    float i = 3.14; // ประกาศตัวแปรชนิด float ชื่อ i และกำหนดค่าเริ่มต้นเป็น 3.14
    int j = (int) i; // ประกาศตัวแปรชนิด int ชื่อ j และกำหนดค่าเริ่มต้นเป็น i โดยมีการแปลงชนิดข้อมูลโดยการใช้ชื่อของชนิดข้อมูลเป้าหมายเป็นคำหลักของตัวแปร

    printf("i = %f\n", i); // แสดงค่าของตัวแปร i โดยใช้ %f แทนตัวแปรชนิด float
    printf("j = %d\n", j); // แสดงค่าของตัวแปร j โดยใช้ %d แทนตัวแปรชนิด int

    printf("----------------\n");

    // ค่าคงที่
    // ค่าคงที่ในภาษา C คือค่าที่ไม่สามารถเปลี่ยนแปลงได้หลังจากที่ประกาศ
    // การประกาศค่าคงที่ในภาษา C สามารถทำได้โดยการใช้คำสั่ง #define หรือ const
    #define PI 3.14 // ประกาศค่าคงที่ชื่อ PI และกำหนดค่าเป็น 3.14
    const int k = 5; // ประกาศค่าคงที่ชื่อ k และกำหนดค่าเป็น 5

    printf("PI = %f\n", PI); // แสดงค่าของค่าคงที่ PI โดยใช้ %f แทนตัวแปรชนิด float
    printf("k = %d\n", k); // แสดงค่าของค่าคงที่ k โดยใช้ %d แทนตัวแปรชนิด int

    printf("----------------\n");

    
}